test/artillery/results-env-test/containerResult.txt
phases:
    AR: 30
    TO: 90
    Duration: 60
performance:
    ttp.codes.200: ................................................................ 7200
    http.downloaded_bytes: ......................................................... 1490400
    http.request_rate: ............................................................. 123/sec
    http.requests: ................................................................. 7200
    http.response_time:
    min: ......................................................................... 1
    max: ......................................................................... 76
    median: ...................................................................... 6
    p95: ......................................................................... 22
    p99: ......................................................................... 41.7
    http.responses: ................................................................ 7200
    vusers.completed: .............................................................. 3600
    vusers.created: ................................................................ 3600
    vusers.created_by_name.0: ...................................................... 3600
    vusers.failed: ................................................................. 0
    vusers.session_length:
    min: ......................................................................... 7.1
    max: ......................................................................... 113.3
    median: ...................................................................... 18.4
    p95: ......................................................................... 54.1
    p99: ......................................................................... 83.9

phases:
    AR: 90
    TO: 180
    Duration: 60
performance:
    errors.ETIMEDOUT: ..................................................... 75
    http.codes.200: ....................................................... 16050
    http.downloaded_bytes: ................................................ 3322350
    http.request_rate: .................................................... 222/sec
    http.requests: ........................................................ 16125
    http.response_time:
    min: ................................................................ 2
    max: ................................................................ 9995
    median: ............................................................. 2276.1
    p95: ................................................................ 9416.8
    p99: ................................................................ 9801.2
    http.responses: ....................................................... 16050
    vusers.completed: ..................................................... 8025
    vusers.created: ....................................................... 8100
    vusers.created_by_name.0: ............................................. 8100
    vusers.failed: ........................................................ 75
    vusers.session_length:
    min: ................................................................ 10.7
    max: ................................................................ 15616.3
    median: ............................................................. 4965.3
    p95: ................................................................ 15218.6
    p99: ................................................................ 15526

phases:
    AR: 180
    TO: 360
    Duration: 60
performance:
    errors.ECONNRESET: ............................................................. 1209
    errors.ETIMEDOUT: .............................................................. 11791
    http.codes.200: ................................................................ 6501
    http.downloaded_bytes: ......................................................... 1345101
    http.request_rate: ............................................................. 286/sec
    http.requests: ................................................................. 19501
    http.response_time:
    min: ......................................................................... 3
    max: ......................................................................... 9995
    median: ...................................................................... 4965.3
    p95: ......................................................................... 9416.8
    p99: ......................................................................... 9801.2
    http.responses: ................................................................ 6501
    vusers.completed: .............................................................. 3200
    vusers.created: ................................................................ 16200
    vusers.created_by_name.0: ...................................................... 16200
    vusers.failed: ................................................................. 13000
    vusers.session_length:
    min: ......................................................................... 18.3
    max: ......................................................................... 19823.9
    median: ...................................................................... 9607.1
    p95: ......................................................................... 18220
    p99: ......................................................................... 18963.6
    ⠹ finally get all the registers done with skip 6 and limit 1500
    node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693205067592,
        socket: 1693205067593,
        lookup: 1693205067594,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693205067595,
        abort: undefined,
        phases: {
        wait: 1,
        dns: 1,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 3
        }
    }
    }

phases:
    AR: 70
    TO: 100
    Duration: 60
    AR: 100
    TO: 150
    Duration: 60
    AR: 150
    TO: 300
    Duration: 30
performance:
    errors.ECONNRESET: ............................................................. 1
    errors.ETIMEDOUT: .............................................................. 1349
    http.codes.200: ................................................................ 54000
    http.downloaded_bytes: ......................................................... 12654000
    http.request_rate: ............................................................. 345/sec
    http.requests: ................................................................. 55350
    http.response_time:
    min: ......................................................................... 1
    max: ......................................................................... 9056
    median: ...................................................................... 10.1
    p95: ......................................................................... 2951.9
    p99: ......................................................................... 3828.5
    http.responses: ................................................................ 54000
    vusers.completed: .............................................................. 18000
    vusers.created: ................................................................ 19350
    vusers.created_by_name.0: ...................................................... 19350
    vusers.failed: ................................................................. 1350
    vusers.session_length:
    min: ......................................................................... 7.7
    max: ......................................................................... 10024.9
    median: ...................................................................... 42.5
    p95: ......................................................................... 4676.2
    p99: ......................................................................... 9416.8

phases:
    AR: 200
    TO: 350
    Duration: 60
performance:
    errors.ECONNREFUSED: ........................................................... 8982
    errors.ECONNRESET: ............................................................. 919
    errors.ETIMEDOUT: .............................................................. 2969
    http.codes.200: ................................................................ 7387
    http.downloaded_bytes: ......................................................... 1528347
    http.request_rate: ............................................................. 338/sec
    http.requests: ................................................................. 20257
    http.response_time:
    min: ......................................................................... 2
    max: ......................................................................... 8601
    median: ...................................................................... 1200.1
    p95: ......................................................................... 5065.6
    p99: ......................................................................... 5487.5
    http.responses: ................................................................ 7387
    vusers.completed: .............................................................. 3630
    vusers.created: ................................................................ 16500
    vusers.created_by_name.0: ...................................................... 16500
    vusers.failed: ................................................................. 12870
    vusers.session_length:
    min: ......................................................................... 12.4
    max: ......................................................................... 11228.9
    median: ...................................................................... 4965.3
    p95: ......................................................................... 7117
    p99: ......................................................................... 8868.4
    ⠦ finally get all the registers done with skip 6 and limit 1500
    ⠧ node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693209912494,
        socket: 1693209912496,
        lookup: 1693209912497,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693209912498,
        abort: undefined,
        phases: {
        wait: 2,
        dns: 1,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 4
        }
    }
    }

phases:
    AR: 200
    TO: 250
    Duration: 60
performance:
    errors.ECONNRESET: ............................................................. 39
    errors.ETIMEDOUT: .............................................................. 4746
    http.codes.200: ................................................................ 17430
    http.downloaded_bytes: ......................................................... 3608010
    http.request_rate: ............................................................. 315/sec
    http.requests: ................................................................. 22215
    http.response_time:
    min: ......................................................................... 4
    max: ......................................................................... 8630
    median: ...................................................................... 757.6
    p95: ......................................................................... 4583.6
    p99: ......................................................................... 5272.4
    http.responses: ................................................................ 17430
    vusers.completed: .............................................................. 8715
    vusers.created: ................................................................ 13500
    vusers.created_by_name.0: ...................................................... 13500
    vusers.failed: ................................................................. 4785
    vusers.session_length:
    min: ......................................................................... 129
    max: ......................................................................... 10588.1
    median: ...................................................................... 4492.8
    p95: ......................................................................... 7709.8
    p99: ......................................................................... 9607.1
phases:
    arrivalRate: 300
    duration: 30
performance:
    errors.ECONNREFUSED: ........................................................... 2150
    errors.ECONNRESET: ............................................................. 1193
    errors.ETIMEDOUT: .............................................................. 3777
    http.codes.200: ................................................................ 4128
    http.downloaded_bytes: ......................................................... 852288
    http.request_rate: ............................................................. 378/sec
    http.requests: ................................................................. 11248
    http.response_time:
    min: ......................................................................... 10
    max: ......................................................................... 8971
    median: ...................................................................... 3197.8
    p95: ......................................................................... 8186.6
    p99: ......................................................................... 8692.8
    http.responses: ................................................................ 4128
    vusers.completed: .............................................................. 1880
    vusers.created: ................................................................ 9000
    vusers.created_by_name.0: ...................................................... 9000
    vusers.failed: ................................................................. 7120
    vusers.session_length:
    min: ......................................................................... 188.5
    max: ......................................................................... 14185.3
    median: ...................................................................... 6064.7
    p95: ......................................................................... 11971.2
    p99: ......................................................................... 12968.3
    ⠼ finally get all the registers done with skip 6 and limit 1500
    node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693210094681,
        socket: 1693210094682,
        lookup: 1693210094682,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693210094683,
        abort: undefined,
        phases: {
        wait: 1,
        dns: 0,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 2
        }
    }
    }
phases:
    arrivalRate: 280
    duration: 30
performance:
    errors.ECONNREFUSED: ........................................................... 2792
    errors.ECONNRESET: ............................................................. 991
    errors.ETIMEDOUT: .............................................................. 2951
    http.codes.200: ................................................................ 3553
    http.downloaded_bytes: ......................................................... 734145
    http.request_rate: ............................................................. 352/sec
    http.requests: ................................................................. 10287
    http.response_time:
    min: ......................................................................... 5
    max: ......................................................................... 8622
    median: ...................................................................... 1353.1
    p95: ......................................................................... 5826.9
    p99: ......................................................................... 6187.2
    http.responses: ................................................................ 3553
    vusers.completed: .............................................................. 1666
    vusers.created: ................................................................ 8400
    vusers.created_by_name.0: ...................................................... 8400
    vusers.failed: ................................................................. 6734
    vusers.session_length:
    min: ......................................................................... 240.5
    max: ......................................................................... 11152
    median: ...................................................................... 5826.9
    p95: ......................................................................... 8024.5
    p99: ......................................................................... 9999.2
    ⠸ finally get all the registers done with skip 6 and limit 1500
    node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693210307019,
        socket: 1693210307021,
        lookup: 1693210307022,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693210307023,
        abort: undefined,
        phases: {
        wait: 2,
        dns: 1,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 4
        }
    }
    }

phases:
    arrivalRate: 280
    duration: 30
performance:
    errors.ECONNREFUSED: ........................................................... 415
errors.ECONNRESET: ............................................................. 1882
errors.ETIMEDOUT: .............................................................. 2889
http.codes.200: ................................................................ 5808
http.downloaded_bytes: ......................................................... 1198776
http.request_rate: ............................................................. 259/sec
http.requests: ................................................................. 10994
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 9990
  median: ...................................................................... 3828.5
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9416.8
http.responses: ................................................................ 5808
vusers.completed: .............................................................. 2614
vusers.created: ................................................................ 7800
vusers.created_by_name.0: ...................................................... 7800
vusers.failed: ................................................................. 5186
vusers.session_length:
  min: ......................................................................... 59.1
  max: ......................................................................... 14612.6
  median: ...................................................................... 7865.6
  p95: ......................................................................... 12711.5
  p99: ......................................................................... 13770.3
⠹ finally get all the registers done with skip 6 and limit 1500
node:internal/process/promises:289
            triggerUncaughtException(err, true /* fromPromise */);
            ^

RequestError
    at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
    at Object.onceWrapper (node:events:629:26)
    at ClientRequest.emit (node:events:526:35)
    at ClientRequest.emit (node:domain:489:12)
    at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
    at Socket.socketErrorListener (node:_http_client:495:9)
    at Socket.emit (node:events:526:35)
    at Socket.emit (node:domain:489:12)
    at emitErrorNT (node:internal/streams/destroy:151:8)
    at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
    at internalConnectMultiple (node:net:1114:18)
    at afterConnectMultiple (node:net:1667:5) {
  code: 'ECONNREFUSED',
  timings: {
    start: 1693210411595,
    socket: 1693210411598,
    lookup: 1693210411598,
    connect: undefined,
    secureConnect: undefined,
    upload: undefined,
    response: undefined,
    end: undefined,
    error: 1693210411601,
    abort: undefined,
    phases: {
      wait: 3,
      dns: 0,
      tcp: undefined,
      tls: undefined,
      request: undefined,
      firstByte: undefined,
      download: undefined,
      total: 6
    }
  }
}

phases:
    arrivalRate: 150
    duration: 30
performance:
    http.codes.200: ................................................................ 9000
    http.downloaded_bytes: ......................................................... 1863000
    http.request_rate: ............................................................. 259/sec
    http.requests: ................................................................. 9000
    http.response_time:
    min: ......................................................................... 9
    max: ......................................................................... 4651
    median: ...................................................................... 1465.9
    p95: ......................................................................... 4403.8
    p99: ......................................................................... 4492.8
    http.responses: ................................................................ 9000
    vusers.completed: .............................................................. 4500
    vusers.created: ................................................................ 4500
    vusers.created_by_name.0: ...................................................... 4500
    vusers.failed: ................................................................. 0
    vusers.session_length:
    min: ......................................................................... 104.3
    max: ......................................................................... 6314.7
    median: ...................................................................... 4403.8
    p95: ......................................................................... 5944.6
    p99: ......................................................................... 6187.2

phases:
    arrivalRate: 190
    duration: 30
performance:
    errors.ETIMEDOUT: .............................................................. 73
    http.codes.200: ................................................................ 11254
    http.downloaded_bytes: ......................................................... 2329578
    http.request_rate: ............................................................. 300/sec
    http.requests: ................................................................. 11327
    http.response_time:
    min: ......................................................................... 4
    max: ......................................................................... 7893
    median: ...................................................................... 2836.2
    p95: ......................................................................... 6702.6
    p99: ......................................................................... 7709.8
    http.responses: ................................................................ 11254
    vusers.completed: .............................................................. 5627
    vusers.created: ................................................................ 5700
    vusers.created_by_name.0: ...................................................... 5700
    vusers.failed: ................................................................. 73
    vusers.session_length:
    min: ......................................................................... 17.4
    max: ......................................................................... 13701.3
    median: ...................................................................... 6702.6
    p95: ......................................................................... 10832
    p99: ......................................................................... 12968.3

phases:
    arrivalRate: 200
    duration: 30
performance:
    errors.ETIMEDOUT: .............................................................. 486
    http.codes.200: ................................................................ 11028
    http.downloaded_bytes: ......................................................... 2282796
    http.request_rate: ............................................................. 237/sec
    http.requests: ................................................................. 11514
    http.response_time:
    min: ......................................................................... 3
    max: ......................................................................... 9977
    median: ...................................................................... 3984.7
    p95: ......................................................................... 8520.7
    p99: ......................................................................... 9230.4
    http.responses: ................................................................ 11028
    vusers.completed: .............................................................. 5514
    vusers.created: ................................................................ 6000
    vusers.created_by_name.0: ...................................................... 6000
    vusers.failed: ................................................................. 486
    vusers.session_length:
    min: ......................................................................... 16.9
    max: ......................................................................... 14301.4
    median: ...................................................................... 9047.6
    p95: ......................................................................... 13770.3
    p99: ......................................................................... 14048.5

phases:
    arrivalRate: 240
    duration: 30
performance:
    errors.ECONNRESET: ............................................................. 2051
    errors.ETIMEDOUT: .............................................................. 1944
    http.codes.200: ................................................................ 6871
    http.downloaded_bytes: ......................................................... 1419531
    http.request_rate: ............................................................. 289/sec
    http.requests: ................................................................. 10866
    http.response_time:
    min: ......................................................................... 3
    max: ......................................................................... 10013
    median: ...................................................................... 3605.5
    p95: ......................................................................... 9416.8
    p99: ......................................................................... 9607.1
    http.responses: ................................................................ 6871
    vusers.completed: .............................................................. 3205
    vusers.created: ................................................................ 7200
    vusers.created_by_name.0: ...................................................... 7200
    vusers.failed: ................................................................. 3995
    vusers.session_length:
    min: ......................................................................... 21.6
    max: ......................................................................... 16258.7
    median: ...................................................................... 6976.1
    p95: ......................................................................... 14332.3
    p99: ......................................................................... 15218.6
    ⠏ finally get all the registers done with skip 6 and limit 1500
    ⠋ node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693210930426,
        socket: 1693210930434,
        lookup: 1693210930437,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693210930441,
        abort: undefined,
        phases: {
        wait: 8,
        dns: 3,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 15
        }
    }
    }

phases:
    arrivalRate: 200
    duration: 30
performance:
    errors.ECONNREFUSED: ........................................................... 984
    errors.ECONNRESET: ............................................................. 1250
    errors.ETIMEDOUT: .............................................................. 734
    http.codes.200: ................................................................ 6402
    http.downloaded_bytes: ......................................................... 1323186
    http.request_rate: ............................................................. 296/sec
    http.requests: ................................................................. 9370
    http.response_time:
    min: ......................................................................... 8
    max: ......................................................................... 8140
    median: ...................................................................... 2059.5
    p95: ......................................................................... 5944.6
    p99: ......................................................................... 6439.7
    http.responses: ................................................................ 6402
    vusers.completed: .............................................................. 3032
    vusers.created: ................................................................ 6000
    vusers.created_by_name.0: ...................................................... 6000
    vusers.failed: ................................................................. 2968
    vusers.session_length:
    min: ......................................................................... 56.1
    max: ......................................................................... 12088
    median: ...................................................................... 3905.8
    p95: ......................................................................... 8186.6
    p99: ......................................................................... 10407.3
    ⠴ finally get all the registers done with skip 6 and limit 1500
    ⠦ node:internal/process/promises:289
                triggerUncaughtException(err, true /* fromPromise */);
                ^

    RequestError
        at ClientRequest.<anonymous> (/usr/lib/node_modules/artillery/node_modules/got/dist/source/core/index.js:970:111)
        at Object.onceWrapper (node:events:629:26)
        at ClientRequest.emit (node:events:526:35)
        at ClientRequest.emit (node:domain:489:12)
        at origin.emit (/usr/lib/node_modules/artillery/node_modules/@szmarczak/http-timer/dist/source/index.js:43:20)
        at Socket.socketErrorListener (node:_http_client:495:9)
        at Socket.emit (node:events:526:35)
        at Socket.emit (node:domain:489:12)
        at emitErrorNT (node:internal/streams/destroy:151:8)
        at emitErrorCloseNT (node:internal/streams/destroy:116:3)AggregateError
        at internalConnectMultiple (node:net:1114:18)
        at afterConnectMultiple (node:net:1667:5) {
    code: 'ECONNREFUSED',
    timings: {
        start: 1693211071281,
        socket: 1693211071283,
        lookup: 1693211071284,
        connect: undefined,
        secureConnect: undefined,
        upload: undefined,
        response: undefined,
        end: undefined,
        error: 1693211071286,
        abort: undefined,
        phases: {
        wait: 2,
        dns: 1,
        tcp: undefined,
        tls: undefined,
        request: undefined,
        firstByte: undefined,
        download: undefined,
        total: 5
        }
    }
    }